// WidgetBlueprintGeneratedClass AgentInventory.AgentInventory_C
// Size : 0x7E0 (Inherited : 0x558)
struct UAgentInventory_C : UPDAgentInventoryUI {
	struct UWidgetAnimation* Anim_SceneOut_Confirm; // 0x558(0x8)
	struct UWidgetAnimation* Anim_CustomFocus_Loop; // 0x560(0x8)
	struct UWidgetAnimation* Anim_SceneShowUp; // 0x568(0x8)
	struct UWidgetAnimation* Anim_FocusShowUp; // 0x570(0x8)
	struct UImage* IMG_ActiveBarDeco; // 0x578(0x8)
	struct UImage* IMG_AgentFocus_Deco_LB; // 0x580(0x8)
	struct UImage* IMG_AgentFocus_Deco_LT; // 0x588(0x8)
	struct UImage* IMG_AgentFocus_Deco_RB; // 0x590(0x8)
	struct UImage* IMG_AgentFocus_Deco_RT; // 0x598(0x8)
	struct UImage* IMG_AgentFocus_Deco_Ruler; // 0x5A0(0x8)
	struct UImage* IMG_AgentSign_Underbar; // 0x5A8(0x8)
	struct UImage* IMG_CustomAgent_Decco_LB; // 0x5B0(0x8)
	struct UImage* IMG_CustomAgent_Decco_LT; // 0x5B8(0x8)
	struct UImage* IMG_CustomAgent_Decco_RB; // 0x5C0(0x8)
	struct UImage* IMG_CustomAgent_Decco_RT; // 0x5C8(0x8)
	struct UImage* IMG_CustomAgent_Deco01; // 0x5D0(0x8)
	struct UImage* IMG_CustomAgent_Deco02; // 0x5D8(0x8)
	struct UImage* IMG_CustomAgent_Deco03; // 0x5E0(0x8)
	struct UImage* IMG_CustomAgent_Deco03_Fx; // 0x5E8(0x8)
	struct UImage* IMG_CustomGame_Decco_LB; // 0x5F0(0x8)
	struct UImage* IMG_CustomGame_Decco_LT; // 0x5F8(0x8)
	struct UImage* IMG_CustomGame_Decco_RB; // 0x600(0x8)
	struct UImage* IMG_CustomGame_Decco_RT; // 0x608(0x8)
	struct UImage* IMG_CustomGame_Deco01; // 0x610(0x8)
	struct UImage* IMG_CustomGame_Deco02; // 0x618(0x8)
	struct UImage* IMG_CustomGame_Deco03; // 0x620(0x8)
	struct UImage* IMG_CustomGame_Deco03_Fx; // 0x628(0x8)
	struct UImage* IMG_CustomWeapon_Decco_LB; // 0x630(0x8)
	struct UImage* IMG_CustomWeapon_Decco_LT; // 0x638(0x8)
	struct UImage* IMG_CustomWeapon_Decco_RB; // 0x640(0x8)
	struct UImage* IMG_CustomWeapon_Decco_RT; // 0x648(0x8)
	struct UImage* IMG_CustomWeapon_Deco01; // 0x650(0x8)
	struct UImage* IMG_CustomWeapon_Deco02; // 0x658(0x8)
	struct UImage* IMG_CustomWeapon_Deco03; // 0x660(0x8)
	struct UImage* IMG_CustomWeapon_Deco03_Fx; // 0x668(0x8)
	struct UImage* IMG_Outglow_Agent; // 0x670(0x8)
	struct UImage* IMG_QuickDeco_Bottom_Normal; // 0x678(0x8)
	struct UImage* IMG_QuickDeco_Bottom_Over; // 0x680(0x8)
	struct UImage* IMG_QuickDeco_LB_Normal; // 0x688(0x8)
	struct UImage* IMG_QuickDeco_LB_Over; // 0x690(0x8)
	struct UImage* IMG_QuickDeco_LT_Normal; // 0x698(0x8)
	struct UImage* IMG_QuickDeco_LT_Over; // 0x6A0(0x8)
	struct UImage* IMG_QuickDeco_RB_Normal; // 0x6A8(0x8)
	struct UImage* IMG_QuickDeco_RB_Over; // 0x6B0(0x8)
	struct UImage* IMG_QuickDeco_RT_Normal; // 0x6B8(0x8)
	struct UImage* IMG_QuickDeco_RT_Over; // 0x6C0(0x8)
	struct UImage* IMG_QuickDeco_Top_Normal; // 0x6C8(0x8)
	struct UImage* IMG_QuickDeco_Top_Over; // 0x6D0(0x8)
	struct UImage* IMG_Rental_Alert; // 0x6D8(0x8)
	struct UImage* IMG_Rental_Bg; // 0x6E0(0x8)
	struct UImage* IMG_Rental_Outline; // 0x6E8(0x8)
	struct UImage* IMG_SCLDeco_Arrow_Normal; // 0x6F0(0x8)
	struct UImage* IMG_SCLDeco_Arrow_Over; // 0x6F8(0x8)
	struct UImage* IMG_SCLDeco_Bottom_Normal; // 0x700(0x8)
	struct UImage* IMG_SCLDeco_Bottom_Over; // 0x708(0x8)
	struct UImage* IMG_SCLDeco_LB_Normal; // 0x710(0x8)
	struct UImage* IMG_SCLDeco_LB_Over; // 0x718(0x8)
	struct UImage* IMG_SCLDeco_LT_Normal; // 0x720(0x8)
	struct UImage* IMG_SCLDeco_LT_Over; // 0x728(0x8)
	struct UImage* IMG_SCLDeco_RB_Normal; // 0x730(0x8)
	struct UImage* IMG_SCLDeco_RB_Over; // 0x738(0x8)
	struct UImage* IMG_SCLDeco_RT_Normal; // 0x740(0x8)
	struct UImage* IMG_SCLDeco_RT_Over; // 0x748(0x8)
	struct UImage* IMG_SCLDeco_Top_Normal; // 0x750(0x8)
	struct UImage* IMG_SCLDeco_Top_Over; // 0x758(0x8)
	struct UImage* IMG_SCRDeco_Arrow_Normal; // 0x760(0x8)
	struct UImage* IMG_SCRDeco_Arrow_Over; // 0x768(0x8)
	struct UImage* IMG_SCRDeco_Bottom_Normal; // 0x770(0x8)
	struct UImage* IMG_SCRDeco_Bottom_Over; // 0x778(0x8)
	struct UImage* IMG_SCRDeco_LB_Normal; // 0x780(0x8)
	struct UImage* IMG_SCRDeco_LB_Over; // 0x788(0x8)
	struct UImage* IMG_SCRDeco_LT_Normal; // 0x790(0x8)
	struct UImage* IMG_SCRDeco_LT_Over; // 0x798(0x8)
	struct UImage* IMG_SCRDeco_RB_Normal; // 0x7A0(0x8)
	struct UImage* IMG_SCRDeco_RB_Over; // 0x7A8(0x8)
	struct UImage* IMG_SCRDeco_RT_Normal; // 0x7B0(0x8)
	struct UImage* IMG_SCRDeco_RT_Over; // 0x7B8(0x8)
	struct UImage* IMG_SCRDeco_Top_Normal; // 0x7C0(0x8)
	struct UImage* IMG_SCRDeco_Top_Over; // 0x7C8(0x8)
	struct UImage* IMG_TitleActiveBar; // 0x7D0(0x8)
	struct UWidgetSwitcher* WS_QuickContract; // 0x7D8(0x8)
};

