// WidgetBlueprintGeneratedClass BreakInto.BreakInto_C
// Size : 0x3D8 (Inherited : 0x380)
struct UBreakInto_C : UPDBreakIntoUI {
	struct UImage* IMG_MapBg; // 0x380(0x8)
	struct UImage* IMG_MapOutline; // 0x388(0x8)
	struct UImage* IMG_PlayerInfo_Bg; // 0x390(0x8)
	struct UImage* IMG_PlayerInfo_Outglow; // 0x398(0x8)
	struct UImage* IMG_PlayerInfo_Outline; // 0x3A0(0x8)
	struct UImage* IMG_SceneBG; // 0x3A8(0x8)
	struct UImage* IMG_TeamArea_Bg; // 0x3B0(0x8)
	struct UCanvasPanel* PW_PlayTimeNum; // 0x3B8(0x8)
	struct URetainerBox* RB_Round; // 0x3C0(0x8)
	struct UPDTextBlock* TB_ATkCaption; // 0x3C8(0x8)
	struct UPDTextBlock* TB_PlayTimeComma; // 0x3D0(0x8)
};

