// WidgetBlueprintGeneratedClass ClanList.ClanList_C
// Size : 0x300 (Inherited : 0x2C0)
struct UClanList_C : UPDClanListUI {
	struct UImage* Img_BottomLine; // 0x2C0(0x8)
	struct UImage* IMG_ClanListContext_Outline; // 0x2C8(0x8)
	struct UImage* IMG_GuideBg; // 0x2D0(0x8)
	struct UImage* IMG_InputBg; // 0x2D8(0x8)
	struct UImage* IMG_MenuBg; // 0x2E0(0x8)
	struct UImage* IMG_Outline; // 0x2E8(0x8)
	struct UImage* IMG_SLotBg; // 0x2F0(0x8)
	struct UImage* IMG_SlotOutline; // 0x2F8(0x8)
};

