// WidgetBlueprintGeneratedClass ClanCreate.ClanCreate_C
// Size : 0x3D8 (Inherited : 0x350)
struct UClanCreate_C : UPDClanCreateUI {
	struct UImage* IMG_Bar_01; // 0x350(0x8)
	struct UImage* IMG_Bar_02; // 0x358(0x8)
	struct UImage* IMG_Bar_03; // 0x360(0x8)
	struct UImage* IMG_Bar_04; // 0x368(0x8)
	struct UImage* IMG_Bar_05; // 0x370(0x8)
	struct UImage* IMG_Bar_06; // 0x378(0x8)
	struct UImage* IMG_ClanDescBG; // 0x380(0x8)
	struct UImage* IMG_InputBg; // 0x388(0x8)
	struct UImage* IMG_InputBg_01; // 0x390(0x8)
	struct UImage* IMG_InputBg_02; // 0x398(0x8)
	struct UImage* IMG_InputBg_03; // 0x3A0(0x8)
	struct UImage* IMG_Outline; // 0x3A8(0x8)
	struct UImage* IMG_Outline_01; // 0x3B0(0x8)
	struct UImage* IMG_Outline_02; // 0x3B8(0x8)
	struct UImage* IMG_Outline_03; // 0x3C0(0x8)
	struct UImage* IMG_SLotBg; // 0x3C8(0x8)
	struct UImage* IMG_SlotOutline; // 0x3D0(0x8)
};

