// WidgetBlueprintGeneratedClass CommunityPopup.CommunityPopup_C
// Size : 0x460 (Inherited : 0x3D0)
struct UCommunityPopup_C : UPDCommunityPopupUI {
	struct UWidgetAnimation* Anim_SceneOut; // 0x3D0(0x8)
	struct UWidgetAnimation* Anim_SceneShowUp; // 0x3D8(0x8)
	struct UImage* IMG_Arrow; // 0x3E0(0x8)
	struct UImage* Img_Bg; // 0x3E8(0x8)
	struct UImage* IMG_CloseBtn_Bg; // 0x3F0(0x8)
	struct UImage* Img_ContentsLine_Bottom; // 0x3F8(0x8)
	struct UImage* Img_ContentsLine_Top; // 0x400(0x8)
	struct UImage* IMG_FindPartyMannerToolTipBg; // 0x408(0x8)
	struct UImage* IMG_FindPartyMannerToolTipOutline; // 0x410(0x8)
	struct UImage* IMG_MannerToolTipBg; // 0x418(0x8)
	struct UImage* IMG_MannerToolTipOutline; // 0x420(0x8)
	struct UImage* IMG_MenuBg; // 0x428(0x8)
	struct UImage* IMG_Outline; // 0x430(0x8)
	struct UImage* IMG_Outline_L; // 0x438(0x8)
	struct UImage* IMG_Outline_T; // 0x440(0x8)
	struct UImage* IMG_ToolTipBg; // 0x448(0x8)
	struct UImage* IMG_ToolTipOutline; // 0x450(0x8)
	struct UImage* IMG_TopBg; // 0x458(0x8)
};

