// WidgetBlueprintGeneratedClass CustomWeapon.CustomWeapon_C
// Size : 0x3E0 (Inherited : 0x380)
struct UCustomWeapon_C : UPDCustomWeaponUI {
	struct UWidgetAnimation* Anim_SceneOut; // 0x380(0x8)
	struct UWidgetAnimation* Anim_SceneShowUp; // 0x388(0x8)
	struct UImage* IMG_ActiveBarDeco; // 0x390(0x8)
	struct UImage* IMG_CategoryBg; // 0x398(0x8)
	struct UImage* IMG_CategoryOutline; // 0x3A0(0x8)
	struct UImage* IMG_ListBg; // 0x3A8(0x8)
	struct UImage* IMG_ListOutline; // 0x3B0(0x8)
	struct UImage* IMG_Outglow_Title; // 0x3B8(0x8)
	struct UImage* IMG_SkinLIstBg; // 0x3C0(0x8)
	struct UImage* IMG_SkinLIstOutline; // 0x3C8(0x8)
	struct UImage* IMG_Stat_Weapon_Divider; // 0x3D0(0x8)
	struct UImage* IMG_TitleActiveBar; // 0x3D8(0x8)
};

