// WidgetBlueprintGeneratedClass DebugLog.DebugLog_C
// Size : 0x3E8 (Inherited : 0x388)
struct UDebugLog_C : UPDDebugLogUI {
	struct UWidgetAnimation* Anim_SceneOut; // 0x388(0x8)
	struct UWidgetAnimation* Anim_SceneShowUp; // 0x390(0x8)
	struct UImage* IMG_ActiveBarDeco; // 0x398(0x8)
	struct UImage* IMG_Arrow_L; // 0x3A0(0x8)
	struct UImage* IMG_Arrow_R; // 0x3A8(0x8)
	struct UImage* Img_Bg; // 0x3B0(0x8)
	struct UImage* IMG_FileListOutline; // 0x3B8(0x8)
	struct UImage* IMG_ListBg; // 0x3C0(0x8)
	struct UImage* IMG_LogBg; // 0x3C8(0x8)
	struct UImage* IMG_LogOutline; // 0x3D0(0x8)
	struct UImage* IMG_Outglow_Title; // 0x3D8(0x8)
	struct UImage* IMG_TitleActiveBar; // 0x3E0(0x8)
};

