// AnimBlueprintGeneratedClass DefaultPlayer.DefaultPlayer_C
// Size : 0xE5F8 (Inherited : 0x5F0)
struct UDefaultPlayer_C : UPDPlayerAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x5F0(0x8)
	struct FAnimNode_Slot AnimGraphNode_Slot_15; // 0x5F8(0x48)
	struct FAnimNode_PDSequencePlayer AnimGraphNode_PDSequencePlayer_14; // 0x640(0x1C8)
	struct FAnimNode_Slot AnimGraphNode_Slot_14; // 0x808(0x48)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_54; // 0x850(0xB0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_12; // 0x900(0xA0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_53; // 0x9A0(0xB0)
	struct FAnimNode_PDSequencePlayer AnimGraphNode_PDSequencePlayer_13; // 0xA50(0x1C8)
	struct FAnimNode_PDSequencePlayer AnimGraphNode_PDSequencePlayer_12; // 0xC18(0x1C8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_32; // 0xDE0(0xB8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_62; // 0xE98(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_61; // 0xEC0(0x28)
	struct FAnimNode_Root AnimGraphNode_Root_7; // 0xEE8(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_51; // 0xF18(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_50; // 0xF40(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_31; // 0xF68(0x78)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_52; // 0xFE0(0xB0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_30; // 0x1090(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_26; // 0x1108(0x30)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_51; // 0x1138(0xB0)
	struct FAnimNode_Slot AnimGraphNode_Slot_13; // 0x11E8(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_12; // 0x1230(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_29; // 0x1278(0x78)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_50; // 0x12F0(0xB0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_35; // 0x13A0(0xE0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_28; // 0x1480(0x78)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_49; // 0x14F8(0xB0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_34; // 0x15A8(0xE0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_25; // 0x1688(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_8; // 0x16B8(0xB0)
	struct FAnimNode_Root AnimGraphNode_Root_6; // 0x1768(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_3; // 0x1798(0x78)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_5; // 0x1810(0xC8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_33; // 0x18D8(0xE0)
	struct FAnimNode_Root AnimGraphNode_Root_5; // 0x19B8(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_49; // 0x19E8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_48; // 0x1A10(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_47; // 0x1A38(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_46; // 0x1A60(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_45; // 0x1A88(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_44; // 0x1AB0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_43; // 0x1AD8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_42; // 0x1B00(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_41; // 0x1B28(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_40; // 0x1B50(0x28)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_48; // 0x1B78(0xB0)
	struct FAnimNode_PDSequencePlayer AnimGraphNode_PDSequencePlayer_11; // 0x1C28(0x1C8)
	struct FAnimNode_PDSequencePlayer AnimGraphNode_PDSequencePlayer_10; // 0x1DF0(0x1C8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_60; // 0x1FB8(0x28)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_2; // 0x1FE0(0xC8)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_4; // 0x20A8(0xC8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_32; // 0x2170(0xE0)
	struct FAnimNode_PDBlendSpacePlayer AnimGraphNode_PDBlendSpacePlayer_6; // 0x2250(0x2B8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_24; // 0x2508(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_59; // 0x2538(0x28)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_47; // 0x2560(0xB0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_27; // 0x2610(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_26; // 0x2688(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_25; // 0x2700(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24; // 0x2778(0x78)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_12; // 0x27F0(0xC0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_23; // 0x28B0(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_58; // 0x28E0(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_22; // 0x2908(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_57; // 0x2938(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_11; // 0x2960(0xC0)
	struct FAnimNode_Slot AnimGraphNode_Slot_11; // 0x2A20(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_56; // 0x2A68(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_21; // 0x2A90(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_7; // 0x2AC0(0xB0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_39; // 0x2B70(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_38; // 0x2B98(0x28)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_46; // 0x2BC0(0xB0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23; // 0x2C70(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22; // 0x2CE8(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_20; // 0x2D60(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_55; // 0x2D90(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_19; // 0x2DB8(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_6; // 0x2DE8(0xB0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_31; // 0x2E98(0xB8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_30; // 0x2F50(0xB8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_29; // 0x3008(0xB8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_37; // 0x30C0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_36; // 0x30E8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_35; // 0x3110(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_34; // 0x3138(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_33; // 0x3160(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_32; // 0x3188(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31; // 0x31B0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30; // 0x31D8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29; // 0x3200(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28; // 0x3228(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_54; // 0x3250(0x28)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x3278(0xC8)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_3; // 0x3340(0xC8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_31; // 0x3408(0xE0)
	struct FAnimNode_PDBlendSpacePlayer AnimGraphNode_PDBlendSpacePlayer_5; // 0x34E8(0x2B8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_18; // 0x37A0(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_53; // 0x37D0(0x28)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_45; // 0x37F8(0xB0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21; // 0x38A8(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20; // 0x3920(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19; // 0x3998(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18; // 0x3A10(0x78)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_10; // 0x3A88(0xC0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_17; // 0x3B48(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_52; // 0x3B78(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_16; // 0x3BA0(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_51; // 0x3BD0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_50; // 0x3BF8(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_9; // 0x3C20(0xC0)
	struct FAnimNode_Slot AnimGraphNode_Slot_10; // 0x3CE0(0x48)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_15; // 0x3D28(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_5; // 0x3D58(0xB0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_28; // 0x3E08(0xB8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27; // 0x3EC0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26; // 0x3EE8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25; // 0x3F10(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24; // 0x3F38(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23; // 0x3F60(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22; // 0x3F88(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21; // 0x3FB0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20; // 0x3FD8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19; // 0x4000(0x28)
	struct FAnimNode_PDSequencePlayer AnimGraphNode_PDSequencePlayer_9; // 0x4028(0x1C8)
	struct FAnimNode_PDSequencePlayer AnimGraphNode_PDSequencePlayer_8; // 0x41F0(0x1C8)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_44; // 0x43B8(0xB0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_14; // 0x4468(0x30)
	struct FAnimNode_PDSequencePlayer AnimGraphNode_PDSequencePlayer_7; // 0x4498(0x1C8)
	struct FAnimNode_PDSequencePlayer AnimGraphNode_PDSequencePlayer_6; // 0x4660(0x1C8)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_43; // 0x4828(0xB0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_13; // 0x48D8(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_49; // 0x4908(0x28)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_5; // 0x4930(0x58)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_12; // 0x4988(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_48; // 0x49B8(0x28)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_4; // 0x49E0(0x58)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0x4A38(0x30)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0x4A68(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_4; // 0x4A98(0xB0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_27; // 0x4B48(0xB8)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_42; // 0x4C00(0xB0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_30; // 0x4CB0(0xE0)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_2; // 0x4D90(0xC8)
	struct FAnimNode_PDBlendSpacePlayer AnimGraphNode_PDBlendSpacePlayer_4; // 0x4E58(0x2B8)
	struct FAnimNode_PDBlendSpacePlayer AnimGraphNode_PDBlendSpacePlayer_3; // 0x5110(0x2B8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_26; // 0x53C8(0xB8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_29; // 0x5480(0xE0)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x5560(0xC8)
	struct FAnimNode_PDBlendSpacePlayer AnimGraphNode_PDBlendSpacePlayer_2; // 0x5628(0x2B8)
	struct FAnimNode_PDBlendSpacePlayer AnimGraphNode_PDBlendSpacePlayer; // 0x58E0(0x2B8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_25; // 0x5B98(0xB8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_11; // 0x5C50(0xA0)
	struct FAnimNode_PDSequencePlayer AnimGraphNode_PDSequencePlayer_5; // 0x5CF0(0x1C8)
	struct FAnimNode_PDSequencePlayer AnimGraphNode_PDSequencePlayer_4; // 0x5EB8(0x1C8)
	struct FAnimNode_Root AnimGraphNode_Root_4; // 0x6080(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_2; // 0x60B0(0x78)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_4; // 0x6128(0xD0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_47; // 0x61F8(0x28)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_41; // 0x6220(0xB0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_40; // 0x62D0(0xB0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_39; // 0x6380(0xB0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_24; // 0x6430(0xB8)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_38; // 0x64E8(0xB0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_28; // 0x6598(0xE0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_23; // 0x6678(0xB8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_27; // 0x6730(0xE0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_26; // 0x6810(0xE0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_25; // 0x68F0(0xE0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_37; // 0x69D0(0xB0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_36; // 0x6A80(0xB0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_35; // 0x6B30(0xB0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_24; // 0x6BE0(0xE0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_23; // 0x6CC0(0xE0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_22; // 0x6DA0(0xE0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_21; // 0x6E80(0xE0)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_3; // 0x6F60(0xD0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_46; // 0x7030(0x28)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_34; // 0x7058(0xB0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_20; // 0x7108(0xE0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_19; // 0x71E8(0xE0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_22; // 0x72C8(0xB8)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_5; // 0x7380(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4; // 0x7488(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3; // 0x7590(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x7698(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4; // 0x77A0(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4; // 0x77C0(0x20)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_33; // 0x77E0(0xB0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_45; // 0x7890(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_44; // 0x78B8(0x28)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_32; // 0x78E0(0xB0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_31; // 0x7990(0xB0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_43; // 0x7A40(0x28)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_30; // 0x7A68(0xB0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_18; // 0x7B18(0xE0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_17; // 0x7BF8(0xE0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_16; // 0x7CD8(0xE0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_29; // 0x7DB8(0xB0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_15; // 0x7E68(0xE0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_28; // 0x7F48(0xB0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_14; // 0x7FF8(0xE0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_27; // 0x80D8(0xB0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_13; // 0x8188(0xE0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_12; // 0x8268(0xE0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_26; // 0x8348(0xB0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_11; // 0x83F8(0xE0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_25; // 0x84D8(0xB0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_10; // 0x8588(0xE0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_24; // 0x8668(0xB0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_9; // 0x8718(0xE0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_23; // 0x87F8(0xB0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_8; // 0x88A8(0xE0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_7; // 0x8988(0xE0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_10; // 0x8A68(0xA0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_6; // 0x8B08(0xE0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_22; // 0x8BE8(0xB0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_5; // 0x8C98(0xE0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x8D78(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3; // 0x8E80(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3; // 0x8EA0(0x20)
	struct FAnimNode_Root AnimGraphNode_Root_3; // 0x8EC0(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x8EF0(0x78)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_21; // 0x8F68(0xB8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_42; // 0x9020(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_8; // 0x9048(0xC0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_41; // 0x9108(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17; // 0x9130(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16; // 0x91A8(0x78)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_21; // 0x9220(0xB0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15; // 0x92D0(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14; // 0x9348(0x78)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_20; // 0x93C0(0xB8)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_20; // 0x9478(0xB0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_40; // 0x9528(0x28)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_19; // 0x9550(0xB0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_18; // 0x9600(0xB0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_7; // 0x96B0(0xC0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_39; // 0x9770(0x28)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_17; // 0x9798(0xB0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_19; // 0x9848(0xB8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13; // 0x9900(0x78)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_16; // 0x9978(0xB0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_15; // 0x9A28(0xB0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_38; // 0x9AD8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_37; // 0x9B00(0x28)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_14; // 0x9B28(0xB0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_13; // 0x9BD8(0xB0)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_2; // 0x9C88(0xD0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_36; // 0x9D58(0x28)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_12; // 0x9D80(0xB0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_18; // 0x9E30(0xB8)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_11; // 0x9EE8(0xB0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_10; // 0x9F98(0xB0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_9; // 0xA048(0xB0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_8; // 0xA0F8(0xB0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_7; // 0xA1A8(0xB0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_35; // 0xA258(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12; // 0xA280(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0xA2F8(0x78)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_17; // 0xA370(0xB8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_34; // 0xA428(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_33; // 0xA450(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0xA478(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0xA4F0(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0xA568(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0xA5E0(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0xA658(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0xA6D0(0x78)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_6; // 0xA748(0xB0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_5; // 0xA7F8(0xB0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_32; // 0xA8A8(0x28)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive; // 0xA8D0(0xD0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_31; // 0xA9A0(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0xA9C8(0x78)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_4; // 0xAA40(0xB0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_30; // 0xAAF0(0x28)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_3; // 0xAB18(0xB0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0xABC8(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_9; // 0xAC40(0xA0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_29; // 0xACE0(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0xAD08(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_8; // 0xAD80(0xA0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_28; // 0xAE20(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_27; // 0xAE48(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7; // 0xAE70(0xA0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xAF10(0x78)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_3; // 0xAF88(0x58)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_2; // 0xAFE0(0x58)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve; // 0xB038(0x58)
	struct FAnimNode_Slot AnimGraphNode_Slot_9; // 0xB090(0x48)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_6; // 0xB0D8(0xC0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_5; // 0xB198(0xC0)
	struct FAnimNode_Slot AnimGraphNode_Slot_8; // 0xB258(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_16; // 0xB2A0(0xB8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_26; // 0xB358(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_25; // 0xB380(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_24; // 0xB3A8(0x28)
	struct FAnimNode_Root AnimGraphNode_Root_2; // 0xB3D0(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18; // 0xB400(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17; // 0xB428(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0xB450(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0xB478(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0xB4A0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0xB4C8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0xB4F0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0xB518(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0xB540(0x28)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2; // 0xB568(0xB0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4; // 0xB618(0xE0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3; // 0xB6F8(0xE0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0xB7D8(0x30)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_5; // 0xB808(0xB0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0xB8B8(0x30)
	struct FAnimNode_RefPose AnimGraphNode_LocalRefPose; // 0xB8E8(0x18)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0xB900(0x30)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0xB930(0xB0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2; // 0xB9E0(0xE0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0xBAC0(0xE0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0xBBA0(0x30)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_4; // 0xBBD0(0xB0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0xBC80(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0xBCB0(0x28)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_3; // 0xBCD8(0xB0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_15; // 0xBD88(0xB8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_14; // 0xBE40(0xB8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_13; // 0xBEF8(0xB8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_12; // 0xBFB0(0xB8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_11; // 0xC068(0xB8)
	struct FAnimNode_LinkedAnimGraph AnimGraphNode_SubInstance_2; // 0xC120(0xA0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_23; // 0xC1C0(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_10; // 0xC1E8(0xB8)
	struct FAnimNode_Slot AnimGraphNode_Slot_7; // 0xC2A0(0x48)
	bool __CustomProperty_bAimingIdleState_3C7ADD0C48259AE1DF84B89D5192CD5B; // 0xC2E8(0x1)
	unsigned char UnknownData_C2E9[0x0003]; // 0xC2E9(0x3)
	float __CustomProperty_AimInterpTime_3C7ADD0C48259AE1DF84B89D5192CD5B; // 0xC2EC(0x4)
	bool __CustomProperty_MirrorFinalPose_3C7ADD0C48259AE1DF84B89D5192CD5B; // 0xC2F0(0x1)
	unsigned char UnknownData_C2F1[0x0007]; // 0xC2F1(0x7)
	struct FPDPerSpecificWeaponAnimDatas __CustomProperty_PSpecificWeaponAnimDatas_3C7ADD0C48259AE1DF84B89D5192CD5B; // 0xC2F8(0xC8)
	bool __CustomProperty_SWStanceIsValid_3C7ADD0C48259AE1DF84B89D5192CD5B; // 0xC3C0(0x1)
	bool __CustomProperty_WStanceIsValid_3C7ADD0C48259AE1DF84B89D5192CD5B; // 0xC3C1(0x1)
	unsigned char UnknownData_C3C2[0x0006]; // 0xC3C2(0x6)
	struct FPDPWUsingInABPAnimDatas __CustomProperty_PWAnimDatas_3C7ADD0C48259AE1DF84B89D5192CD5B; // 0xC3C8(0x128)
	struct FAnimNode_LinkedAnimGraph AnimGraphNode_SubInstance; // 0xC4F0(0xA0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4; // 0xC590(0xC0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_9; // 0xC650(0xB8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_22; // 0xC708(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_21; // 0xC730(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_20; // 0xC758(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_19; // 0xC780(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_18; // 0xC7A8(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_6; // 0xC7D0(0x48)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3; // 0xC818(0xC0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6; // 0xC8D8(0xA0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0xC978(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2; // 0xC9A8(0xB0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_17; // 0xCA58(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_8; // 0xCA80(0xB8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_16; // 0xCB38(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_5; // 0xCB60(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15; // 0xCBA8(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0xCBD0(0xC0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_7; // 0xCC90(0xB8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14; // 0xCD48(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_6; // 0xCD70(0xB8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13; // 0xCE28(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_4; // 0xCE50(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12; // 0xCE98(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5; // 0xCEC0(0xA0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0xCF60(0xC0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11; // 0xD020(0x28)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_3; // 0xD048(0xB0)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_2; // 0xD0F8(0xB0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10; // 0xD1A8(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4; // 0xD1D0(0xA0)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0xD270(0xB0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0xD320(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0xD348(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0xD370(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0xD398(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0xD3C0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0xD3E8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0xD410(0x28)
	struct FAnimNode_PDSequencePlayer AnimGraphNode_PDSequencePlayer_3; // 0xD438(0x1C8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0xD600(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xD630(0x28)
	struct FAnimNode_PDSequencePlayer AnimGraphNode_PDSequencePlayer_2; // 0xD658(0x1C8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0xD820(0x30)
	struct FAnimNode_PDSequencePlayer AnimGraphNode_PDSequencePlayer; // 0xD850(0x1C8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0xDA18(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0xDA48(0xB0)
	struct FAnimNode_Root AnimGraphNode_Root; // 0xDAF8(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9; // 0xDB28(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0xDB50(0xA0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5; // 0xDBF0(0xB8)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2; // 0xDCA8(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0xDCC8(0x20)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone_2; // 0xDCE8(0xF0)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0xDDD8(0x20)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0xDDF8(0xF0)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0xDEE8(0x20)
	struct FAnimNode_Slot AnimGraphNode_Slot_3; // 0xDF08(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4; // 0xDF50(0xB8)
	struct FAnimNode_Slot AnimGraphNode_Slot_2; // 0xE008(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8; // 0xE050(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3; // 0xE078(0xB8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7; // 0xE130(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0xE158(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0xE180(0xA0)
	struct FAnimNode_Mirror AnimGraphNode_Mirror; // 0xE220(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0xE248(0xB8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0xE300(0xB8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0xE3B8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0xE3E0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0xE408(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0xE430(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xE458(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0xE480(0x48)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0xE4C8(0xA0)
	struct FAnimNode_PoseSnapshot AnimGraphNode_PoseSnapshot; // 0xE568(0x90)

	void Facial(struct FPoseLink Facial); // Function DefaultPlayer.DefaultPlayer_C.Facial // (HasOutParms|BlueprintCallable|BlueprintEvent) // Param Size : 0x10, 0x7FF653FAFDF0
	void GroggyLocomotion(struct FPoseLink GroggyLocomotion); // Function DefaultPlayer.DefaultPlayer_C.GroggyLocomotion // (HasOutParms|BlueprintCallable|BlueprintEvent) // Param Size : 0x10, 0x7FF653FAFDF0
	void FireRecoil(struct FPoseLink InPose_FireRecoil, struct FPoseLink FireRecoil); // Function DefaultPlayer.DefaultPlayer_C.FireRecoil // (HasOutParms|BlueprintCallable|BlueprintEvent) // Param Size : 0x20, 0x7FF653FAFDF0
	void DefaultLocomotion(struct FPoseLink DefaultLocomotion); // Function DefaultPlayer.DefaultPlayer_C.DefaultLocomotion // (HasOutParms|BlueprintCallable|BlueprintEvent) // Param Size : 0x10, 0x7FF653FAFDF0
