// WidgetBlueprintGeneratedClass FriendListItem.FriendListItem_C
// Size : 0x3E8 (Inherited : 0x3A8)
struct UFriendListItem_C : UPDFriendListItem {
	struct UImage* Img_BottomLine; // 0x3A8(0x8)
	struct UImage* IMG_Category_Arrow; // 0x3B0(0x8)
	struct UImage* IMG_Category_BottomLine; // 0x3B8(0x8)
	struct UImage* IMG_Face_Outline; // 0x3C0(0x8)
	struct UImage* IMG_GradeNone_Bg; // 0x3C8(0x8)
	struct UImage* IMG_PictureBg; // 0x3D0(0x8)
	struct UImage* IMG_ToolTipBg; // 0x3D8(0x8)
	struct UImage* IMG_ToolTipOutline; // 0x3E0(0x8)
};

