// WidgetBlueprintGeneratedClass FriendClanItem.FriendClanItem_C
// Size : 0x3C0 (Inherited : 0x380)
struct UFriendClanItem_C : UPDFriendClanItem {
	struct UImage* Img_BottomLine; // 0x380(0x8)
	struct UImage* IMG_Category_Arrow; // 0x388(0x8)
	struct UImage* IMG_Category_BottomLine; // 0x390(0x8)
	struct UImage* IMG_Face_Outline; // 0x398(0x8)
	struct UImage* IMG_GradeNone_Bg; // 0x3A0(0x8)
	struct UImage* IMG_PictureBg; // 0x3A8(0x8)
	struct UImage* IMG_ToolTipBg; // 0x3B0(0x8)
	struct UImage* IMG_ToolTipOutline; // 0x3B8(0x8)
};

