// WidgetBlueprintGeneratedClass GameResult.GameResult_C
// Size : 0x8A4 (Inherited : 0x618)
struct UGameResult_C : UPDGameResultUI {
	struct UWidgetAnimation* Anim_Summary_Rank; // 0x618(0x8)
	struct UWidgetAnimation* Anim_RewardAppear; // 0x620(0x8)
	struct UWidgetAnimation* Anim_LevelUp_GaugeGlow; // 0x628(0x8)
	struct UWidgetAnimation* Anim_LevelUp; // 0x630(0x8)
	struct UWidgetAnimation* Anim_ExpAppear; // 0x638(0x8)
	struct UWidgetAnimation* Anim_ScoreboardAppear; // 0x640(0x8)
	struct UWidgetAnimation* Anim_Summary_BlueDefeat; // 0x648(0x8)
	struct UWidgetAnimation* Anim_Summary_BlueWin; // 0x650(0x8)
	struct UWidgetAnimation* Anim_GuideAppear; // 0x658(0x8)
	struct UWidgetAnimation* Anim_DefeatAppear; // 0x660(0x8)
	struct UWidgetAnimation* Anim_VictoryAppear_Orange; // 0x668(0x8)
	struct UWidgetAnimation* Anim_VictoryAppear_Blue; // 0x670(0x8)
	struct UWidgetAnimation* Anim_SummaryMenuAppear; // 0x678(0x8)
	struct UWidgetAnimation* Anim_Defeat; // 0x680(0x8)
	struct UWidgetAnimation* Anim_Victory; // 0x688(0x8)
	struct UImage* IMG_BottomDeco_Fx01; // 0x690(0x8)
	struct UImage* IMG_BottomDeco_Fx02; // 0x698(0x8)
	struct UImage* IMG_CurrentExp_Bar01; // 0x6A0(0x8)
	struct UImage* IMG_CurrentExp_Bar02; // 0x6A8(0x8)
	struct UImage* IMG_CurrentLv_Wings; // 0x6B0(0x8)
	struct UImage* IMG_Exp_TopDeco_Fx01; // 0x6B8(0x8)
	struct UImage* IMG_Exp_TopDeco_Fx02; // 0x6C0(0x8)
	struct UImage* IMG_Exp_TopDeco_Fx03; // 0x6C8(0x8)
	struct UImage* IMG_Exp_TopDeco_Fx04; // 0x6D0(0x8)
	struct UImage* IMG_Exp_TopDeco_Fx05; // 0x6D8(0x8)
	struct UImage* IMG_Exp_TopDeco_Fx06; // 0x6E0(0x8)
	struct UImage* IMG_Exp_TopDeco_Wings; // 0x6E8(0x8)
	struct UImage* IMG_ExpGauge_Bg; // 0x6F0(0x8)
	struct UImage* IMG_ExpGauge_Outglow; // 0x6F8(0x8)
	struct UImage* IMG_FX_TitleGlow_Blue01; // 0x700(0x8)
	struct UImage* IMG_FX_TitleGlow_Blue02; // 0x708(0x8)
	struct UImage* IMG_FX_TitleGlow_Yellow01; // 0x710(0x8)
	struct UImage* IMG_FX_TitleGlow_Yellow02; // 0x718(0x8)
	struct UImage* IMG_Hyphen; // 0x720(0x8)
	struct UImage* IMG_Match_Blinder; // 0x728(0x8)
	struct UImage* IMG_Match_FadeBg; // 0x730(0x8)
	struct UImage* IMG_NextLv_Wings; // 0x738(0x8)
	struct UImage* IMG_Outglow_Bottom; // 0x740(0x8)
	struct UImage* IMG_Outglow_Top; // 0x748(0x8)
	struct UImage* IMG_PrevExpBar01; // 0x750(0x8)
	struct UImage* IMG_PrevExpBar02; // 0x758(0x8)
	struct UImage* IMG_Progress_SlotBg; // 0x760(0x8)
	struct UImage* IMG_Reward_BgDeco_L01; // 0x768(0x8)
	struct UImage* IMG_Reward_BgDeco_L02; // 0x770(0x8)
	struct UImage* IMG_Reward_BgDeco_R01; // 0x778(0x8)
	struct UImage* IMG_Reward_BgDeco_R02; // 0x780(0x8)
	struct UImage* IMG_Reward_TopDeco_Fx01; // 0x788(0x8)
	struct UImage* IMG_Reward_TopDeco_Fx01_4; // 0x790(0x8)
	struct UImage* IMG_Reward_TopDeco_Fx02; // 0x798(0x8)
	struct UImage* IMG_Reward_TopDeco_Fx03; // 0x7A0(0x8)
	struct UImage* IMG_Reward_TopDeco_Fx04; // 0x7A8(0x8)
	struct UImage* IMG_RewardTitle_Bg; // 0x7B0(0x8)
	struct UImage* IMG_RewardTitle_Fx; // 0x7B8(0x8)
	struct UImage* IMG_SummaryFX_BlueWin01; // 0x7C0(0x8)
	struct UImage* IMG_SummaryFX_BlueWin02; // 0x7C8(0x8)
	struct UImage* IMG_ToolTipBg; // 0x7D0(0x8)
	struct UImage* IMG_ToolTipOutline; // 0x7D8(0x8)
	struct UImage* IMG_TopDeco_L01; // 0x7E0(0x8)
	struct UImage* IMG_TopDeco_L02; // 0x7E8(0x8)
	struct UImage* IMG_TopDeco_L03; // 0x7F0(0x8)
	struct UImage* IMG_TopDeco_L04; // 0x7F8(0x8)
	struct UImage* IMG_TopDeco_L05; // 0x800(0x8)
	struct UImage* IMG_TopDeco_L06; // 0x808(0x8)
	struct UImage* IMG_TopDeco_L07; // 0x810(0x8)
	struct UImage* IMG_TopDeco_L08; // 0x818(0x8)
	struct UImage* IMG_TopDeco_L09; // 0x820(0x8)
	struct UImage* IMG_TopDeco_L10; // 0x828(0x8)
	struct UImage* IMG_TotalExp_Bg; // 0x830(0x8)
	struct URetainerBox* RB_RewardTitle_BgMask; // 0x838(0x8)
	struct URoundResultItem_C* RoundResultItem; // 0x840(0x8)
	struct URoundResultItem_C* RoundResultItem_2; // 0x848(0x8)
	struct URoundResultItem_C* RoundResultItem_3; // 0x850(0x8)
	struct URoundResultItem_C* RoundResultItem_4; // 0x858(0x8)
	struct URoundResultItem_C* RoundResultItem_5; // 0x860(0x8)
	struct URoundResultItem_C* RoundResultItem_6; // 0x868(0x8)
	struct URoundResultItem_C* RoundResultItem_7; // 0x870(0x8)
	struct URoundResultItem_C* RoundResultItem_8; // 0x878(0x8)
	struct URoundResultItem_C* RoundResultItem_9; // 0x880(0x8)
	struct URichTextBlock* RT_Time; // 0x888(0x8)
	int32_t Percent_Temp; // 0x890(0x4)
	struct FVector2D T_CurExp; // 0x894(0x8)
	struct FVector2D PArrow; // 0x89C(0x8)
};

