// WidgetBlueprintGeneratedClass InvenDivide.InvenDivide_C
// Size : 0x338 (Inherited : 0x2D8)
struct UInvenDivide_C : UPDInvenDivide {
	struct UImage* IMG_AfterItemBg; // 0x2D8(0x8)
	struct UImage* IMG_Arrow_01; // 0x2E0(0x8)
	struct UImage* IMG_Arrow_02; // 0x2E8(0x8)
	struct UImage* IMG_BeforeItemBg; // 0x2F0(0x8)
	struct UImage* Img_Bg; // 0x2F8(0x8)
	struct UImage* IMG_Blinder; // 0x300(0x8)
	struct UImage* IMG_Outline; // 0x308(0x8)
	struct UImage* IMG_SliderBar_01; // 0x310(0x8)
	struct UImage* IMG_SliderBar_02; // 0x318(0x8)
	struct UImage* IMG_SliderBar_03; // 0x320(0x8)
	struct UImage* IMG_SliderBar_04; // 0x328(0x8)
	struct UImage* IMG_SliderBar_Bg; // 0x330(0x8)
};

