// WidgetBlueprintGeneratedClass MailPopup.MailPopup_C
// Size : 0x330 (Inherited : 0x2E8)
struct UMailPopup_C : UPDMailPopupUI {
	struct UWidgetAnimation* Anim_SceneOut; // 0x2E8(0x8)
	struct UWidgetAnimation* Anim_SceneShowUp; // 0x2F0(0x8)
	struct UImage* Img_Bg; // 0x2F8(0x8)
	struct UImage* IMG_CloseBtn_Bg; // 0x300(0x8)
	struct UImage* Img_ContentsLine_Bottom; // 0x308(0x8)
	struct UImage* Img_ContentsLine_Top; // 0x310(0x8)
	struct UImage* IMG_Outline_L; // 0x318(0x8)
	struct UImage* IMG_Outline_T; // 0x320(0x8)
	struct UImage* IMG_TopBg; // 0x328(0x8)
};

