// WidgetBlueprintGeneratedClass Match.Match_C
// Size : 0x398 (Inherited : 0x2E8)
struct UMatch_C : UPDMatchUI {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2E8(0x8)
	struct UImage* IMG_AnimIndicator_A; // 0x2F0(0x8)
	struct UImage* IMG_AnimIndicator_B; // 0x2F8(0x8)
	struct UImage* IMG_BgCase_Bridge; // 0x300(0x8)
	struct UImage* IMG_BgCase_Derail; // 0x308(0x8)
	struct UImage* IMG_BgCase_Dmitry; // 0x310(0x8)
	struct UImage* IMG_BgCase_Jack; // 0x318(0x8)
	struct UImage* IMG_BgCase_Luna; // 0x320(0x8)
	struct UImage* IMG_BgCase_Nicki; // 0x328(0x8)
	struct UImage* IMG_BgCase_Rose; // 0x330(0x8)
	struct UImage* IMG_BgCase_Shipyard; // 0x338(0x8)
	struct UImage* IMG_BgCase_Simon; // 0x340(0x8)
	struct UImage* IMG_BgCase_Soy; // 0x348(0x8)
	struct UImage* IMG_BgCase_Tutorial; // 0x350(0x8)
	struct UImage* IMG_BgCase_Tyrone; // 0x358(0x8)
	struct UImage* IMG_BgCase_Vignetting; // 0x360(0x8)
	struct UImage* IMG_BgCase_WindFarm; // 0x368(0x8)
	struct UImage* IMG_BgCase_YoungSik; // 0x370(0x8)
	struct UImage* IMG_Black; // 0x378(0x8)
	struct UImage* IMG_DescriptionShade_01; // 0x380(0x8)
	struct UImage* IMG_Divider; // 0x388(0x8)
	struct UImage* IMG_Mode_Outline; // 0x390(0x8)

	void PreConstruct(bool IsDesignTime); // Function Match.Match_C.PreConstruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // Param Size : 0x1, 0x7FF653FAFDF0
	void ExecuteUbergraph_Match(int32_t EntryPoint); // Function Match.Match_C.ExecuteUbergraph_Match // (Final|UbergraphFunction) // Param Size : 0x4, 0x7FF653FAFDF0
};

