// WidgetBlueprintGeneratedClass OKPopup.OKPopup_C
// Size : 0x328 (Inherited : 0x2D0)
struct UOKPopup_C : UPDOKPopupUI {
	struct UWidgetAnimation* Anim_SceneOut; // 0x2D0(0x8)
	struct UWidgetAnimation* Anim_SceneShowUp; // 0x2D8(0x8)
	struct UImage* IMG_Blinder; // 0x2E0(0x8)
	struct UImage* IMG_BottomBar; // 0x2E8(0x8)
	struct UImage* IMG_BoxGlow; // 0x2F0(0x8)
	struct UImage* IMG_Deco_BL; // 0x2F8(0x8)
	struct UImage* IMG_Deco_BR; // 0x300(0x8)
	struct UImage* IMG_Deco_TL; // 0x308(0x8)
	struct UImage* IMG_Deco_TR; // 0x310(0x8)
	struct UImage* IMG_PopupBg; // 0x318(0x8)
	struct UImage* IMG_TopBar; // 0x320(0x8)
};

