// WidgetBlueprintGeneratedClass OptionContent.OptionContent_C
// Size : 0x400 (Inherited : 0x3A0)
struct UOptionContent_C : UPDOptionContent {
	struct UImage* IMG_CrossHairB; // 0x3A0(0x8)
	struct UImage* IMG_CrossHairC; // 0x3A8(0x8)
	struct UImage* IMG_CrossHairC_2; // 0x3B0(0x8)
	struct UImage* IMG_CrossHairC_B; // 0x3B8(0x8)
	struct UImage* IMG_CrossHairC_C; // 0x3C0(0x8)
	struct UImage* IMG_CrossHairC_L; // 0x3C8(0x8)
	struct UImage* IMG_CrossHairC_R; // 0x3D0(0x8)
	struct UImage* IMG_CrossHairC_T; // 0x3D8(0x8)
	struct UImage* IMG_CrossHairL; // 0x3E0(0x8)
	struct UImage* IMG_CrossHairR; // 0x3E8(0x8)
	struct UImage* IMG_Outline; // 0x3F0(0x8)
	struct UImage* IMG_Outline_2; // 0x3F8(0x8)
};

