// WidgetBlueprintGeneratedClass OptionPopup.OptionPopup_C
// Size : 0x3F0 (Inherited : 0x398)
struct UOptionPopup_C : UPDOptionPopupUI {
	struct UWidgetAnimation* Anim_SceneOut; // 0x398(0x8)
	struct UWidgetAnimation* Anim_SceneShowUp; // 0x3A0(0x8)
	struct UImage* Img_BgBox; // 0x3A8(0x8)
	struct UImage* IMG_Blinder; // 0x3B0(0x8)
	struct UImage* Img_BottomLine; // 0x3B8(0x8)
	struct UImage* Img_ContentsLine_Bottom; // 0x3C0(0x8)
	struct UImage* Img_ContentsLine_Top; // 0x3C8(0x8)
	struct UImage* IMG_Ratings_01; // 0x3D0(0x8)
	struct UImage* IMG_Ratings_02; // 0x3D8(0x8)
	struct UImage* IMG_Ratings_03; // 0x3E0(0x8)
	struct UImage* Img_TopLine; // 0x3E8(0x8)
};

