// WidgetBlueprintGeneratedClass OutGameTopMenu.OutGameTopMenu_C
// Size : 0x540 (Inherited : 0x458)
struct UOutGameTopMenu_C : UPDOutGameTopMenu {
	struct UWidgetAnimation* Anim_SceneOut_Agent; // 0x458(0x8)
	struct UWidgetAnimation* Anim_SceneOut_Lobby; // 0x460(0x8)
	struct UWidgetAnimation* Anim_SceneShowUp_Agent; // 0x468(0x8)
	struct UWidgetAnimation* Anim_SceneShowUp; // 0x470(0x8)
	struct UPDButton_C* BTN_GradeNone; // 0x478(0x8)
	struct UImage* IMG_ActiveBarDeco_Clan; // 0x480(0x8)
	struct UImage* IMG_ActiveBarDeco_Customizing; // 0x488(0x8)
	struct UImage* IMG_ActiveBarDeco_GameGuide; // 0x490(0x8)
	struct UImage* IMG_ActiveBarDeco_Training; // 0x498(0x8)
	struct UImage* IMG_CurrencyIcon; // 0x4A0(0x8)
	struct UImage* IMG_GradeNone; // 0x4A8(0x8)
	struct UImage* IMG_MailBoxIcon; // 0x4B0(0x8)
	struct UImage* IMG_MannerToolTipBg; // 0x4B8(0x8)
	struct UImage* IMG_MannerToolTipOutline; // 0x4C0(0x8)
	struct UImage* IMG_MenuBg; // 0x4C8(0x8)
	struct UImage* IMG_MenuOutglow; // 0x4D0(0x8)
	struct UImage* IMG_OptionIcon_HoverDown; // 0x4D8(0x8)
	struct UImage* IMG_OptionIcon_Normal; // 0x4E0(0x8)
	struct UImage* IMG_Outline; // 0x4E8(0x8)
	struct UImage* IMG_PDLogo; // 0x4F0(0x8)
	struct UImage* IMG_Register; // 0x4F8(0x8)
	struct UImage* IMG_Register_Disabled; // 0x500(0x8)
	struct UImage* IMG_Register_Searching; // 0x508(0x8)
	struct UImage* IMG_Register_Searching_Outline; // 0x510(0x8)
	struct UImage* IMG_SlotDivider_2; // 0x518(0x8)
	struct UImage* IMG_SlotDivider_3; // 0x520(0x8)
	struct UImage* IMG_ToolTipBg; // 0x528(0x8)
	struct UImage* IMG_ToolTipOutline; // 0x530(0x8)
	struct UWidgetSwitcher* WS_Btn_Case; // 0x538(0x8)
};

