// WidgetBlueprintGeneratedClass Perk.Perk_C
// Size : 0x458 (Inherited : 0x3E8)
struct UPerk_C : UPDPerkUI {
	struct UPDImage* IMG_SLotBg; // 0x3E8(0x8)
	struct UPDImage* IMG_SlotBG01; // 0x3F0(0x8)
	struct UPDImage* IMG_SlotBG02; // 0x3F8(0x8)
	struct UPDImage* IMG_SlotBG03; // 0x400(0x8)
	struct UPDImage* IMG_SlotBG04; // 0x408(0x8)
	struct UPDImage* IMG_SlotBG05; // 0x410(0x8)
	struct UPDImage* IMG_SlotBG06; // 0x418(0x8)
	struct UPerkEntryItem_C* PEI_Perk01; // 0x420(0x8)
	struct UPerkEntryItem_C* PEI_Perk02; // 0x428(0x8)
	struct UPerkEntryItem_C* PEI_Perk03; // 0x430(0x8)
	struct UPerkEntryItem_C* PEI_Perk04; // 0x438(0x8)
	struct UPerkEntryItem_C* PEI_Perk05; // 0x440(0x8)
	struct URetainerBox* RB_Alert; // 0x448(0x8)
	struct URetainerBox* RB_Signature; // 0x450(0x8)
};

