// WidgetBlueprintGeneratedClass PlayerEquipSlotThrowable.PlayerEquipSlotThrowable_C
// Size : 0x400 (Inherited : 0x380)
struct UPlayerEquipSlotThrowable_C : UPDPlayerEquipmentSlotMulti {
	struct UImage* IMG_Icon_ActiveMelee; // 0x380(0x8)
	struct UImage* IMG_Icon_ActiveSub; // 0x388(0x8)
	struct UImage* IMG_Icon_ActiveWp; // 0x390(0x8)
	struct UImage* IMG_Line; // 0x398(0x8)
	struct UImage* IMG_Logo; // 0x3A0(0x8)
	struct UProgressBar* PB_Progress_Sub; // 0x3A8(0x8)
	struct UProgressBar* PB_Progress_Wp; // 0x3B0(0x8)
	struct UPDImage* PDImage_5; // 0x3B8(0x8)
	struct UPDTextBlock* TB_CurrentRounds; // 0x3C0(0x8)
	struct UPDTextBlock* TB_FireMode; // 0x3C8(0x8)
	struct UPDTextBlock* TB_Num_2; // 0x3D0(0x8)
	struct UPDTextBlock* TB_Num_3; // 0x3D8(0x8)
	struct UPDTextBlock* TB_Num_4; // 0x3E0(0x8)
	struct UPDTextBlock* TB_Num_Active; // 0x3E8(0x8)
	struct UPDTextBlock* TB_StackCount; // 0x3F0(0x8)
	struct UPDTextBlock* TB_TotalRounds; // 0x3F8(0x8)
};

