// WidgetBlueprintGeneratedClass PlayerInfo.PlayerInfo_C
// Size : 0x4E0 (Inherited : 0x470)
struct UPlayerInfo_C : UPDPlayerInfoUI {
	struct UWidgetAnimation* AnimBow; // 0x470(0x8)
	struct UWidgetAnimation* HPAlretEnd; // 0x478(0x8)
	struct UWidgetAnimation* HPAlretStart; // 0x480(0x8)
	struct UWidgetAnimation* CarryBomb; // 0x488(0x8)
	struct UImage* IMG_BasicBack; // 0x490(0x8)
	struct UImage* IMG_BasicBack_2; // 0x498(0x8)
	struct UImage* IMG_Eject; // 0x4A0(0x8)
	struct UImage* IMG_Line; // 0x4A8(0x8)
	struct UImage* IMG_Line_2; // 0x4B0(0x8)
	struct UImage* IMG_Logo_2; // 0x4B8(0x8)
	struct UImage* IMG_Logo_3; // 0x4C0(0x8)
	struct UPDImage* PDImage; // 0x4C8(0x8)
	struct UPDImage* PDImage_5; // 0x4D0(0x8)
	struct UPlayerEquipmentSlotS_C* PlayerEquipmentSlotS; // 0x4D8(0x8)
};

