// WidgetBlueprintGeneratedClass PlayerSettingUI.PlayerSettingUI_C
// Size : 0x560 (Inherited : 0x4C0)
struct UPlayerSettingUI_C : UPDPlayerSettingUI {
	struct UImage* Img_Bg; // 0x4C0(0x8)
	struct UImage* IMG_Blinder; // 0x4C8(0x8)
	struct UImage* IMG_BottomPad; // 0x4D0(0x8)
	struct UImage* IMG_EquipSlot_UnEquipped1; // 0x4D8(0x8)
	struct UImage* IMG_EquipSlot_UnEquipped2; // 0x4E0(0x8)
	struct UImage* IMG_EquipSlot_UnEquipped3; // 0x4E8(0x8)
	struct UImage* IMG_LeptonInfo_Bg; // 0x4F0(0x8)
	struct UImage* IMG_LeptonInfo_Outline; // 0x4F8(0x8)
	struct UImage* IMG_Map_UnderDeco; // 0x500(0x8)
	struct UImage* IMG_Map_UnderLine; // 0x508(0x8)
	struct UImage* IMG_Matching_Timer; // 0x510(0x8)
	struct UImage* IMG_Mode_UnderDeco; // 0x518(0x8)
	struct UImage* IMG_Mode_UnderLine; // 0x520(0x8)
	struct UImage* IMG_SignatureInfo_Bg; // 0x528(0x8)
	struct UImage* IMG_SignatureInfo_Outline; // 0x530(0x8)
	struct UImage* IMG_TeamMode_UnderDeco; // 0x538(0x8)
	struct UImage* IMG_TeamMode_UnderLine; // 0x540(0x8)
	struct UImage* IMG_TopPad; // 0x548(0x8)
	struct UImage* IMG_UniqueLeptonInfo_Bg; // 0x550(0x8)
	struct UImage* IMG_UniqueLeptonInfo_Outline; // 0x558(0x8)
};

