// WidgetBlueprintGeneratedClass ResultRankScore.ResultRankScore_C
// Size : 0x338 (Inherited : 0x2C8)
struct UResultRankScore_C : UPDResultRankScore {
	struct UWidgetAnimation* appear; // 0x2C8(0x8)
	struct UImage* IMG_ScoreBoard_Line03; // 0x2D0(0x8)
	struct UImage* IMG_ScoreBoard_TopBg02; // 0x2D8(0x8)
	struct UImage* IMG_ScoreBoard_TopDeco; // 0x2E0(0x8)
	struct UResultRankScoreItem_C* RankScoreItem01; // 0x2E8(0x8)
	struct UResultRankScoreItem_C* RankScoreItem02; // 0x2F0(0x8)
	struct UResultRankScoreItem_C* RankScoreItem03; // 0x2F8(0x8)
	struct UResultRankScoreItem_C* RankScoreItem04; // 0x300(0x8)
	struct UResultRankScoreItem_C* RankScoreItem05; // 0x308(0x8)
	struct UResultRankScoreItem_C* RankScoreItem06; // 0x310(0x8)
	struct UResultRankScoreItem_C* RankScoreItem07; // 0x318(0x8)
	struct UResultRankScoreItem_C* RankScoreItem08; // 0x320(0x8)
	struct UResultRankScoreItem_C* RankScoreItem09; // 0x328(0x8)
	struct UResultRankScoreItem_C* RankScoreItem10; // 0x330(0x8)
};

