// WidgetBlueprintGeneratedClass RingCommand.RingCommand_C
// Size : 0x500 (Inherited : 0x4C0)
struct URingCommand_C : UPDRingCommandUI {
	struct UImage* Image; // 0x4C0(0x8)
	struct UImage* Image_2; // 0x4C8(0x8)
	struct UImage* IMG_ArrowL; // 0x4D0(0x8)
	struct UImage* IMG_ArrowR; // 0x4D8(0x8)
	struct UImage* IMG_Back1; // 0x4E0(0x8)
	struct UImage* IMG_Back2_1; // 0x4E8(0x8)
	struct UImage* IMG_Back2_2; // 0x4F0(0x8)
	struct UImage* IMG_MouseR; // 0x4F8(0x8)
};

