// WidgetBlueprintGeneratedClass RoundInfo.RoundInfo_C
// Size : 0x428 (Inherited : 0x3B8)
struct URoundInfo_C : UPDRoundInfoUI {
	struct UWidgetAnimation* TimeAlret; // 0x3B8(0x8)
	struct UWidgetAnimation* BombDefuse; // 0x3C0(0x8)
	struct UWidgetAnimation* BombCount; // 0x3C8(0x8)
	struct UWidgetAnimation* BombSet; // 0x3D0(0x8)
	struct UImage* IMG_InfoBackM; // 0x3D8(0x8)
	struct UImage* IMG_ShopGuide_Bg; // 0x3E0(0x8)
	struct UImage* IMG_ShopGuide_Outline; // 0x3E8(0x8)
	struct UImage* IMG_ShopGuide_TitleBar; // 0x3F0(0x8)
	struct UImage* IMG_ShopGuide_TitleDecoL; // 0x3F8(0x8)
	struct UImage* IMG_ShopGuide_TitleDecoR; // 0x400(0x8)
	struct UCanvasPanel* PW_PlayTimeNum; // 0x408(0x8)
	struct UPDTextBlock* TB_PlayTimeComma; // 0x410(0x8)
	struct UPDTextBlock* TB_PlayTimeMin; // 0x418(0x8)
	struct UPDTextBlock* TB_PlayTimeSec; // 0x420(0x8)
};

