// WidgetBlueprintGeneratedClass SkyView.SkyView_C
// Size : 0x3F0 (Inherited : 0x358)
struct USkyView_C : UPDSkyViewUI {
	struct UWidgetAnimation* AlertStart; // 0x358(0x8)
	struct UWidgetAnimation* AlertEnd; // 0x360(0x8)
	struct UWidgetAnimation* Anim_Cam; // 0x368(0x8)
	struct UWidgetAnimation* Anim_Rec; // 0x370(0x8)
	struct UWidgetAnimation* Anim_FocusBar; // 0x378(0x8)
	struct UWidgetAnimation* Anim_Equalizer; // 0x380(0x8)
	struct UPDImage* IMG_AlertBack; // 0x388(0x8)
	struct UImage* IMG_AtkIcon; // 0x390(0x8)
	struct UPDImage* IMG_Deco; // 0x398(0x8)
	struct UImage* IMG_DefIcon; // 0x3A0(0x8)
	struct UImage* IMG_MapBg; // 0x3A8(0x8)
	struct UImage* IMG_MapShadow; // 0x3B0(0x8)
	struct UImage* IMG_MissionIcon; // 0x3B8(0x8)
	struct UPDImage* IMG_Recently01Back; // 0x3C0(0x8)
	struct UPDImage* IMG_Recently02Back; // 0x3C8(0x8)
	struct UPDTextBlock* TB_ATkCaption; // 0x3D0(0x8)
	struct UPDTextBlock* TB_DefCaption; // 0x3D8(0x8)
	struct UPDTextBlock* TB_MissionScoreSubTitle; // 0x3E0(0x8)
	struct UPDTextBlock* TB_MissionScoreTitle; // 0x3E8(0x8)
};

