// WidgetBlueprintGeneratedClass SpectatorTarget.SpectatorTarget_C
// Size : 0x7B0 (Inherited : 0x4E8)
struct USpectatorTarget_C : UPDSpectatorTargetInfo {
	struct UWidgetAnimation* SlotOff; // 0x4E8(0x8)
	struct UWidgetAnimation* SlotOn; // 0x4F0(0x8)
	struct UWidgetAnimation* HPAlretEnd; // 0x4F8(0x8)
	struct UWidgetAnimation* HPAlretStart; // 0x500(0x8)
	struct UWidgetAnimation* CarryBomb; // 0x508(0x8)
	struct UImage* IMG_GroggyIcon; // 0x510(0x8)
	struct UImage* IMG_KeyBack_A; // 0x518(0x8)
	struct UImage* IMG_KeyBack_C; // 0x520(0x8)
	struct UImage* IMG_KeyBack_D; // 0x528(0x8)
	struct UImage* IMG_KeyBack_E; // 0x530(0x8)
	struct UImage* IMG_KeyBack_F; // 0x538(0x8)
	struct UImage* IMG_KeyBack_LCtrl; // 0x540(0x8)
	struct UImage* IMG_KeyBack_LShift; // 0x548(0x8)
	struct UImage* IMG_KeyBack_MLB; // 0x550(0x8)
	struct UImage* IMG_KeyBack_MMB; // 0x558(0x8)
	struct UImage* IMG_KeyBack_MRB; // 0x560(0x8)
	struct UImage* IMG_KeyBack_MWD; // 0x568(0x8)
	struct UImage* IMG_KeyBack_MWU; // 0x570(0x8)
	struct UImage* IMG_KeyBack_Q; // 0x578(0x8)
	struct UImage* IMG_KeyBack_R; // 0x580(0x8)
	struct UImage* IMG_KeyBack_S; // 0x588(0x8)
	struct UImage* IMG_KeyBack_Space; // 0x590(0x8)
	struct UImage* IMG_KeyBack_V; // 0x598(0x8)
	struct UImage* IMG_KeyBack_W; // 0x5A0(0x8)
	struct UImage* IMG_KeyBack_X; // 0x5A8(0x8)
	struct UImage* IMG_KeyBack_Z; // 0x5B0(0x8)
	struct UImage* IMG_Line; // 0x5B8(0x8)
	struct UImage* IMG_Line_3; // 0x5C0(0x8)
	struct UImage* IMG_Line_4; // 0x5C8(0x8)
	struct UImage* IMG_Line_5; // 0x5D0(0x8)
	struct UImage* IMG_Line_6; // 0x5D8(0x8)
	struct UImage* IMG_Line_7; // 0x5E0(0x8)
	struct UImage* IMG_Line_8; // 0x5E8(0x8)
	struct UImage* IMG_Line_9; // 0x5F0(0x8)
	struct UImage* IMG_Line_10; // 0x5F8(0x8)
	struct UImage* IMG_Line_11; // 0x600(0x8)
	struct UImage* IMG_Line_12; // 0x608(0x8)
	struct UImage* IMG_Line_13; // 0x610(0x8)
	struct UImage* IMG_Line_14; // 0x618(0x8)
	struct UImage* IMG_Line_15; // 0x620(0x8)
	struct UImage* IMG_Line_16; // 0x628(0x8)
	struct UImage* IMG_Mouse; // 0x630(0x8)
	struct UPDImage* IMG_STline_2; // 0x638(0x8)
	struct USpectator_Key_C* Key_2; // 0x640(0x8)
	struct USpectator_Key_C* Key_3; // 0x648(0x8)
	struct USpectator_Key_C* Key_4; // 0x650(0x8)
	struct USpectator_Key_C* Key_5; // 0x658(0x8)
	struct USpectator_Key_C* Key_6; // 0x660(0x8)
	struct USpectator_Key_C* Key_7; // 0x668(0x8)
	struct USpectator_Key_C* Key_8; // 0x670(0x8)
	struct USpectator_Key_C* Key_9; // 0x678(0x8)
	struct USpectator_Key_C* Key_10; // 0x680(0x8)
	struct USpectator_Key_C* Key_11; // 0x688(0x8)
	struct USpectator_Key_C* Key_; // 0x690(0x8)
	struct USpectator_Key_C* Key_+; // 0x698(0x8)
	struct USpectator_Key_C* Key_-; // 0x6A0(0x8)
	struct USpectator_Key_C* Key_B; // 0x6A8(0x8)
	struct USpectator_KeyL_C* Key_Caps; // 0x6B0(0x8)
	struct USpectator_KeyR_C* Key_Empty2; // 0x6B8(0x8)
	struct USpectator_KeyR_C* Key_Empty3; // 0x6C0(0x8)
	struct USpectator_KeyR_C* Key_Enter; // 0x6C8(0x8)
	struct USpectator_KeyL_C* Key_Fn; // 0x6D0(0x8)
	struct USpectator_Key_C* Key_G; // 0x6D8(0x8)
	struct USpectator_Key_C* Key_H; // 0x6E0(0x8)
	struct USpectator_Key_C* Key_I; // 0x6E8(0x8)
	struct USpectator_Key_C* Key_J; // 0x6F0(0x8)
	struct USpectator_Key_C* Key_K; // 0x6F8(0x8)
	struct USpectator_Key_C* Key_L; // 0x700(0x8)
	struct USpectator_Key_C* Key_L_2; // 0x708(0x8)
	struct USpectator_Key_C* Key_L_3; // 0x710(0x8)
	struct USpectator_KeyL_C* Key_LAlt; // 0x718(0x8)
	struct USpectator_Key_C* Key_M; // 0x720(0x8)
	struct USpectator_Key_C* Key_Mark1; // 0x728(0x8)
	struct USpectator_Key_C* Key_Mark2; // 0x730(0x8)
	struct USpectator_Key_C* Key_Mark3; // 0x738(0x8)
	struct USpectator_Key_C* Key_N; // 0x740(0x8)
	struct USpectator_Key_C* Key_O; // 0x748(0x8)
	struct USpectator_Key_C* Key_P; // 0x750(0x8)
	struct USpectator_Key_C* Key_P_2; // 0x758(0x8)
	struct USpectator_Key_C* Key_P_3; // 0x760(0x8)
	struct USpectator_Key_C* Key_P_4; // 0x768(0x8)
	struct USpectator_KeyR_C* Key_RAlt; // 0x770(0x8)
	struct USpectator_KeyR_C* Key_RAlt_2; // 0x778(0x8)
	struct USpectator_KeyR_C* Key_Rshift; // 0x780(0x8)
	struct USpectator_Key_C* Key_T; // 0x788(0x8)
	struct USpectator_KeyL_C* Key_Tab; // 0x790(0x8)
	struct USpectator_Key_C* Key_U; // 0x798(0x8)
	struct USpectator_Key_C* Key_Y; // 0x7A0(0x8)
	struct USpectator_KeyR_C* Spectator_KeyR; // 0x7A8(0x8)
};

