// WidgetBlueprintGeneratedClass SpectatorPlayerAlly.SpectatorPlayerAlly_C
// Size : 0x648 (Inherited : 0x5A0)
struct USpectatorPlayerAlly_C : UPDSpectatorEntryAlly {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x5A0(0x8)
	struct UWidgetAnimation* HealthAlert; // 0x5A8(0x8)
	struct UWidgetAnimation* Damage; // 0x5B0(0x8)
	struct UImage* IMG_ArmorBg; // 0x5B8(0x8)
	struct UImage* IMG_NameBG; // 0x5C0(0x8)
	struct UImage* IMG_PlayerNameBg; // 0x5C8(0x8)
	struct UImage* IMG_PlayerNameBg_Dead; // 0x5D0(0x8)
	struct UImage* IMG_PlayerPicBlind_Dead; // 0x5D8(0x8)
	struct UImage* IMG_PlayerState_Dead; // 0x5E0(0x8)
	struct UImage* IMG_SlotBG01_Dead; // 0x5E8(0x8)
	struct UImage* IMG_SlotBG02_Dead; // 0x5F0(0x8)
	struct UImage* IMG_SlotBG03_Dead; // 0x5F8(0x8)
	struct UImage* IMG_SlotBG04_Dead; // 0x600(0x8)
	struct UImage* IMG_SlotBG05_Dead; // 0x608(0x8)
	struct UImage* IMG_SlotBG06_Dead; // 0x610(0x8)
	struct UImage* IMG_SlotBG07_Dead; // 0x618(0x8)
	struct UImage* IMG_SlotBGAgent_Dead; // 0x620(0x8)
	struct UImage* IMG_SlotBGMelee_Dead; // 0x628(0x8)
	struct UImage* IMG_SlotBGRevival_Dead; // 0x630(0x8)
	struct UImage* IMG_SlotBGSeed_Dead; // 0x638(0x8)
	struct UImage* IMG_SlotOutline; // 0x640(0x8)

	void Construct(); // Function SpectatorPlayerAlly.SpectatorPlayerAlly_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // Param Size : 0x0, 0x7FF653FAFDF0
	void ExecuteUbergraph_SpectatorPlayerAlly(int32_t EntryPoint); // Function SpectatorPlayerAlly.SpectatorPlayerAlly_C.ExecuteUbergraph_SpectatorPlayerAlly // (Final|UbergraphFunction) // Param Size : 0x4, 0x7FF653FAFDF0
};

