// WidgetBlueprintGeneratedClass SpectatorPlayerEnemy.SpectatorPlayerEnemy_C
// Size : 0x4F8 (Inherited : 0x498)
struct USpectatorPlayerEnemy_C : UPDSpectatorPlayerEntry {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x498(0x8)
	struct UImage* IMG_NameBG; // 0x4A0(0x8)
	struct UImage* IMG_PlayerNameBg; // 0x4A8(0x8)
	struct UImage* IMG_PlayerNameBg_Dead; // 0x4B0(0x8)
	struct UImage* IMG_PlayerPicBlind_Dead; // 0x4B8(0x8)
	struct UImage* IMG_PlayerState; // 0x4C0(0x8)
	struct UImage* IMG_PlayerState_Dead; // 0x4C8(0x8)
	struct UImage* IMG_SlotBG01_Dead; // 0x4D0(0x8)
	struct UImage* IMG_SlotBG02_Dead; // 0x4D8(0x8)
	struct UImage* IMG_SlotBG03_Dead; // 0x4E0(0x8)
	struct UImage* IMG_SlotBGMelee_Dead; // 0x4E8(0x8)
	struct UImage* IMG_SlotOutline; // 0x4F0(0x8)

	void Construct(); // Function SpectatorPlayerEnemy.SpectatorPlayerEnemy_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // Param Size : 0x0, 0x7FF653FAFDF0
	void ExecuteUbergraph_SpectatorPlayerEnemy(int32_t EntryPoint); // Function SpectatorPlayerEnemy.SpectatorPlayerEnemy_C.ExecuteUbergraph_SpectatorPlayerEnemy // (Final|UbergraphFunction) // Param Size : 0x4, 0x7FF653FAFDF0
};

