// WidgetBlueprintGeneratedClass StatusBoardPlayerInfo_Ally.StatusBoardPlayerInfo_Ally_C
// Size : 0x448 (Inherited : 0x3F8)
struct UStatusBoardPlayerInfo_Ally_C : UPDStatusBoardPlayerInfo_Ally {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x3F8(0x8)
	struct UImage* IMG_Death; // 0x400(0x8)
	struct UImage* IMG_Idle; // 0x408(0x8)
	struct UImage* IMG_Muted; // 0x410(0x8)
	struct UImage* IMG_NoAudio; // 0x418(0x8)
	struct UImage* IMG_Ping_Bg; // 0x420(0x8)
	struct UImage* IMG_Rescue; // 0x428(0x8)
	struct UImage* IMG_Speaking; // 0x430(0x8)
	struct UImage* IMG_SpeakingAnim; // 0x438(0x8)
	struct UImage* Img_TopLine; // 0x440(0x8)

	void Construct(); // Function StatusBoardPlayerInfo_Ally.StatusBoardPlayerInfo_Ally_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // Param Size : 0x0, 0x7FF653FAFDF0
	void ExecuteUbergraph_StatusBoardPlayerInfo_Ally(int32_t EntryPoint); // Function StatusBoardPlayerInfo_Ally.StatusBoardPlayerInfo_Ally_C.ExecuteUbergraph_StatusBoardPlayerInfo_Ally // (Final|UbergraphFunction) // Param Size : 0x4, 0x7FF653FAFDF0
};

