// WidgetBlueprintGeneratedClass StatusBoardMap.StatusBoardMap_C
// Size : 0x4E0 (Inherited : 0x450)
struct UStatusBoardMap_C : UPDStatusBoardGameMap {
	struct UImage* IMG_Coordinate_H01; // 0x450(0x8)
	struct UImage* IMG_Coordinate_H02; // 0x458(0x8)
	struct UImage* IMG_Coordinate_H03; // 0x460(0x8)
	struct UImage* IMG_Coordinate_H04; // 0x468(0x8)
	struct UImage* IMG_Coordinate_H05; // 0x470(0x8)
	struct UImage* IMG_Coordinate_H06; // 0x478(0x8)
	struct UImage* IMG_Coordinate_H07; // 0x480(0x8)
	struct UImage* IMG_Coordinate_H08; // 0x488(0x8)
	struct UImage* IMG_Coordinate_H09; // 0x490(0x8)
	struct UImage* IMG_Coordinate_V01; // 0x498(0x8)
	struct UImage* IMG_Coordinate_V02; // 0x4A0(0x8)
	struct UImage* IMG_Coordinate_V03; // 0x4A8(0x8)
	struct UImage* IMG_Coordinate_V04; // 0x4B0(0x8)
	struct UImage* IMG_Coordinate_V05; // 0x4B8(0x8)
	struct UImage* IMG_Coordinate_V06; // 0x4C0(0x8)
	struct UImage* IMG_Coordinate_V07; // 0x4C8(0x8)
	struct UImage* IMG_Coordinate_V08; // 0x4D0(0x8)
	struct UImage* IMG_Coordinate_V09; // 0x4D8(0x8)
};

