// WidgetBlueprintGeneratedClass UnKnownMarketUpgradeItemSlot.UnKnownMarketUpgradeItemSlot_C
// Size : 0x5B0 (Inherited : 0x4A0)
struct UUnKnownMarketUpgradeItemSlot_C : UPDUnKnownMarketUpgradeItemSlot {
	struct UImage* IMG_Current_ARMORY; // 0x4A0(0x8)
	struct UImage* IMG_Current_DEFENCE; // 0x4A8(0x8)
	struct UImage* IMG_Current_ORDNANCE; // 0x4B0(0x8)
	struct UImage* IMG_Current_TACTICAL; // 0x4B8(0x8)
	struct UImage* IMG_GaugeBg; // 0x4C0(0x8)
	struct UImage* IMG_GaugeOutline; // 0x4C8(0x8)
	struct UImage* IMG_GlowBox_ARMORY; // 0x4D0(0x8)
	struct UImage* IMG_GlowBox_DEFENCE; // 0x4D8(0x8)
	struct UImage* IMG_GlowBox_ORDNANCE; // 0x4E0(0x8)
	struct UImage* IMG_GlowBox_TACTICAL; // 0x4E8(0x8)
	struct UImage* IMG_GlowLine_ARMORY; // 0x4F0(0x8)
	struct UImage* IMG_GlowLine_DEFENCE; // 0x4F8(0x8)
	struct UImage* IMG_GlowLine_ORDNANCE; // 0x500(0x8)
	struct UImage* IMG_GlowLine_TACTICAL; // 0x508(0x8)
	struct UImage* IMG_LevelBg_ARMORY; // 0x510(0x8)
	struct UImage* IMG_LevelBg_DEFENCE; // 0x518(0x8)
	struct UImage* IMG_LevelBg_Off; // 0x520(0x8)
	struct UImage* IMG_LevelBg_ORDNANCE; // 0x528(0x8)
	struct UImage* IMG_LevelBg_TACTICAL; // 0x530(0x8)
	struct UImage* IMG_LockIcon_ARMORY; // 0x538(0x8)
	struct UImage* IMG_LockIcon_DEFENCE; // 0x540(0x8)
	struct UImage* IMG_LockIcon_ORDNANCE; // 0x548(0x8)
	struct UImage* IMG_LockIcon_TACTICAL; // 0x550(0x8)
	struct UImage* IMG_OutLine_ARMORY; // 0x558(0x8)
	struct UImage* IMG_OutLine_DEFENCE; // 0x560(0x8)
	struct UImage* IMG_OutLine_ORDNANCE; // 0x568(0x8)
	struct UImage* IMG_OutLine_TACTICAL; // 0x570(0x8)
	struct UImage* IMG_SlotBg_ARMORY; // 0x578(0x8)
	struct UImage* IMG_SlotBg_DEFENCE; // 0x580(0x8)
	struct UImage* IMG_SlotBg_Else; // 0x588(0x8)
	struct UImage* IMG_SlotBg_First; // 0x590(0x8)
	struct UImage* IMG_SlotBg_Off; // 0x598(0x8)
	struct UImage* IMG_SlotBg_ORDNANCE; // 0x5A0(0x8)
	struct UImage* IMG_SlotBg_TACTICAL; // 0x5A8(0x8)
};

