// WidgetBlueprintGeneratedClass UnKnownMarketInvenListItem.UnKnownMarketInvenListItem_C
// Size : 0x430 (Inherited : 0x3D0)
struct UUnKnownMarketInvenListItem_C : UPDInvenListItem {
	struct UImage* IMG_Dragable; // 0x3D0(0x8)
	struct UImage* IMG_FullGuide_Bg; // 0x3D8(0x8)
	struct UImage* IMG_FullGuide_Deco01; // 0x3E0(0x8)
	struct UImage* IMG_FullGuide_Deco02; // 0x3E8(0x8)
	struct UImage* IMG_FullGuide_Deco03; // 0x3F0(0x8)
	struct UImage* IMG_FullGuide_Deco04; // 0x3F8(0x8)
	struct UImage* IMG_FullGuide_Icon; // 0x400(0x8)
	struct UImage* IMG_InvenDragable_Deco_01; // 0x408(0x8)
	struct UImage* IMG_Refund; // 0x410(0x8)
	struct UImage* IMG_SlotTitle_Recover_Bg; // 0x418(0x8)
	struct UImage* IMG_SlotTitle_Recover_BgBg; // 0x420(0x8)
	struct UInvalidationBox* InvalidationBox_4; // 0x428(0x8)
};

