// WidgetBlueprintGeneratedClass UnKnownMarket.UnKnownMarket_C
// Size : 0x900 (Inherited : 0x818)
struct UUnKnownMarket_C : UPDUnKnownMarket {
	struct UWidgetAnimation* Anim_TeamBuff; // 0x818(0x8)
	struct UWidgetAnimation* Anim_LoseCoin; // 0x820(0x8)
	struct UWidgetAnimation* Anim_GetCoin; // 0x828(0x8)
	struct UImage* IMG_CoinIcon; // 0x830(0x8)
	struct UImage* IMG_InvenBg; // 0x838(0x8)
	struct UImage* IMG_InvenDragable_Deco_01; // 0x840(0x8)
	struct UImage* IMG_InvenListDragable; // 0x848(0x8)
	struct UImage* IMG_ItemSlot_BottomLine; // 0x850(0x8)
	struct UImage* IMG_Market_Bg; // 0x858(0x8)
	struct UImage* IMG_Market_MidLine_01; // 0x860(0x8)
	struct UImage* IMG_Market_MidLine_02; // 0x868(0x8)
	struct UImage* IMG_Market_MidLine_03; // 0x870(0x8)
	struct UImage* IMG_Market_OutLine; // 0x878(0x8)
	struct UImage* IMG_Market_Shadow; // 0x880(0x8)
	struct UImage* IMG_Market_TopLine; // 0x888(0x8)
	struct UImage* IMG_MarketTabMenuBg; // 0x890(0x8)
	struct UImage* IMG_PickupDragable_Deco_01; // 0x898(0x8)
	struct UImage* IMG_PickupListDragable; // 0x8A0(0x8)
	struct UImage* IMG_Signature_Guide; // 0x8A8(0x8)
	struct UImage* IMG_SlotTitle_MissionItem_Bg; // 0x8B0(0x8)
	struct UImage* IMG_SlotTitle_MissionItem_BgBg; // 0x8B8(0x8)
	struct UImage* IMG_SlotTitle_Recover_Bg; // 0x8C0(0x8)
	struct UImage* IMG_SlotTitle_Recover_BgBg; // 0x8C8(0x8)
	struct UImage* IMG_SlotTitle_Throw_Bg; // 0x8D0(0x8)
	struct UImage* IMG_SlotTitle_Throw_BgBg; // 0x8D8(0x8)
	struct UImage* IMG_TeamCoinIcon; // 0x8E0(0x8)
	struct UImage* IMG_TooltipCoin; // 0x8E8(0x8)
	struct UImage* IMG_VicinityBg; // 0x8F0(0x8)
	struct UImage* IMG_WeaponSlot_BottomLine; // 0x8F8(0x8)
};

