// WidgetBlueprintGeneratedClass UnKnownMarketListItem.UnKnownMarketListItem_C
// Size : 0x568 (Inherited : 0x4E8)
struct UUnKnownMarketListItem_C : UPDUnKnownMarketListItem {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x4E8(0x8)
	struct UWidgetAnimation* Hover; // 0x4F0(0x8)
	struct UImage* IMG_Activate_Bg; // 0x4F8(0x8)
	struct UImage* IMG_Activate_Fx; // 0x500(0x8)
	struct UImage* IMG_Activate_FxBg; // 0x508(0x8)
	struct UImage* IMG_Activate_Outline; // 0x510(0x8)
	struct UImage* IMG_Blink; // 0x518(0x8)
	struct UImage* IMG_BuyBtnBg; // 0x520(0x8)
	struct UImage* IMG_Cancel; // 0x528(0x8)
	struct UImage* IMG_EmptyBg; // 0x530(0x8)
	struct UImage* IMG_Lock_Bg; // 0x538(0x8)
	struct UImage* IMG_Owned_Bg; // 0x540(0x8)
	struct UImage* IMG_Sell_Bg; // 0x548(0x8)
	struct UImage* IMG_SoldOut_Bg; // 0x550(0x8)
	struct UImage* IMG_VXLogo; // 0x558(0x8)
	struct URetainerBox* RB_ItemSlot; // 0x560(0x8)

	void Construct(); // Function UnKnownMarketListItem.UnKnownMarketListItem_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // Param Size : 0x0, 0x7FF653FAFDF0
	void ExecuteUbergraph_UnKnownMarketListItem(int32_t EntryPoint); // Function UnKnownMarketListItem.UnKnownMarketListItem_C.ExecuteUbergraph_UnKnownMarketListItem // (Final|UbergraphFunction) // Param Size : 0x4, 0x7FF653FAFDF0
};

